Documents/ДвижениеНЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДвижениеНЗП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДвиженияНЗП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗакрытиеМесяца</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДвижениеНЗП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатратБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатратНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУчетаНУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийДвиженияНЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДвиженияНЗП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтнесениеНаНЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзНЗП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеНЗП/Ext/ObjectModule.bsl
Перем мПроведениеОперацииИзвне Экспорт; // (Регл)
Перем мУдалениеИзвне Экспорт; // (Регл)


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область УправлениеДоступом

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ОбщегоНазначенияБК.ЗаполнитьНаборыПоОрганизацииСтурктурномуПодразделению(ЭтотОбъект, Таблица, "Организация", "СтруктурноеПодразделение");
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	// Проверка заполнения табличной части "Товары"
	Если НЕ ПолучитьФункциональнуюОпцию("ПлательщикКПН", Новый Структура("Организация, Период", Организация, Дата)) 
		ИЛИ НЕ УчитыватьКПН  Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Состав.ВидУчетаНУ");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.СчетЗатратНУ");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.СуммаНУ");
	КонецЕсли;
	
	Если  НЕ ОтражатьВБухгалтерскомУчете  Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Состав.СчетЗатратБУ");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.Сумма");
	КонецЕсли;
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.ДвижениеНЗП.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УчетПроизводства.СформироватьДвиженияНЗПБУ(ПараметрыПроведения.ТаблицаНЗПБУ, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетПроизводства.СформироватьДвиженияНЗПНУ(ПараметрыПроведения.ТаблицаНЗПНУ, ПараметрыПроведения.Реквизиты, Движения, Отказ);

	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Если (мПроведениеОперацииИзвне = Неопределено) И (ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ОтнесениеНаНЗП) И
				 ДокументОснование.ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ВозвратИзНЗП Тогда
				 ТекстСообщения = "У текущего документа существует документ переноса из НЗП на счета производственного учета
				 |"""+ ДокументОснование + """. 
				 |Он так же будет проведен.";
				 ОбщегоНазначенияБККлиентСервер.СообщитьОбОшибке(НСтр("ru = '"+ТекстСообщения));	
				 ТекущийДокументОснование = ДокументОснование.ПолучитьОбъект();
				 ТекущийДокументОснование.мПроведениеОперацииИзвне = Истина;
				 ТекущийДокументОснование.Записать(РежимЗаписиДокумента.Проведение);
				 
			КонецЕсли;		 
		КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ВозвратИзНЗП Тогда
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если ДокументОснование.ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ОтнесениеНаНЗП Тогда
				Если мУдалениеИзвне = Неопределено Тогда
					Если мПроведениеОперацииИзвне = Неопределено Тогда
						ТекстСообщения = "У текущего документа существует документ-основание """+ ДокументОснование + """. 
						|Отмена проведения текущего документа возможна только посредством отмены проведения документа-основания.";
						ОбщегоНазначения.СообщитьПользователю(НСтр("ru = '"+ТекстСообщения+"'"), Ссылка, , , Отказ);
					КонецЕсли;		 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		 
		
	Иначе
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Если ДокументОснование.ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ВозвратИзНЗП Тогда
				
				ТекстСообщения = "У текущего документа существует документ переноса из НЗП """+ ДокументОснование + """. 
				|Он так же будет снят с проведения.";
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = '"+ТекстСообщения+"'"), Ссылка);
				
				ТекущийДокументОснование = ДокументОснование.ПолучитьОбъект();
				ТекущийДокументОснование.мПроведениеОперацииИзвне = Истина;
				ТекущийДокументОснование.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;		 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления  <> Ссылка.ПометкаУдаления  Тогда
		Если ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ВозвратИзНЗП Тогда
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				Если ДокументОснование.ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ОтнесениеНаНЗП Тогда
					Если мУдалениеИзвне = Неопределено 	Тогда
						ТекстСообщения = "У текущего документа существует документ-основание 
						|"""+ ДокументОснование + """." + 
						?(Ссылка.ПометкаУдаления = Ложь, "
						|Удаление текущего документа возможно только посредством удаления документа-основания.", "
						|Снятие пометки на удаление текущего документа возможно только посредством снятия пометки удаления документа-основания.");
						ОбщегоНазначения.СообщитьПользователю(НСтр("ru = '"+ТекстСообщения+"'"), Ссылка, , , Отказ);
					КонецЕсли;		 
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				Если ДокументОснование.ВидОперации = Перечисления.ВидыОперацийДвиженияНЗП.ВозвратИзНЗП Тогда
					ТекстСообщения = "У текущего документа существует документ переноса из НЗП
					|"""+ ДокументОснование + """."+ 
					?(Ссылка.ПометкаУдаления = Ложь, "
					|Он так же будет удален.", "
					|С него также будет снята пометка удаления.");
					
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = '"+ТекстСообщения+"'"), Ссылка);
					ТекущийДокументОснование = ДокументОснование.ПолучитьОбъект();
					ТекущийДокументОснование.мУдалениеИзвне = Истина;
					ТекущийДокументОснование.УстановитьПометкуУдаления(?(Ссылка.ПометкаУдаления = Ложь, Истина, Ложь));
				КонецЕсли;		 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	// Посчитать сумму документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСИАкциза.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


#КонецЕсли
